app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
 LIMIT 10
---
    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        try {
            $model = new ArtikelModel();

            // Build query dengan error handling
            $builder = $model->table('artikel')
                ->select('artikel.*, kategori.nama_kategori')
                ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'LEFT');

            if ($q != '') {
                $builder->like('artikel.judul', $q);
            }
            if ($kategori_id != '') {
                $builder->where('artikel.id_kategori', $kategori_id);
            }

            $artikel = $builder->orderBy('artikel.id', 'DESC')->paginate(10, 'default', $page);

SELECT *
FROM `kategori`
---

            try {
                $kategoriModel = new KategoriModel();
                $data['kategori'] = $kategoriModel->findAll();

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`status` = 1
AND `artikel`.`slug` = 'angkasawan'
 LIMIT 1
---
    public function view($slug)
    {
        try {
            $model = new ArtikelModel();

            // Get article with category information
            $builder = $model->table('artikel')
                ->select('artikel.*, kategori.nama_kategori')
                ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'LEFT')
                ->where('artikel.status', 1); // Only published articles

            // Try to find by slug first
            $data['artikel'] = $builder->where('artikel.slug', $slug)->first();