app/Controllers/Page.php

    public function home()
    {
        $artikelModel = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $kategori_id = $this->request->getVar('kategori_id');
        $q = $this->request->getVar('q');

        $artikel = $artikelModel->orderBy('created_at', 'DESC');

        if ($kategori_id) {
            $artikel->where('id_kategori', $kategori_id);
        }
        if ($q) {
            $artikel->like('judul', $q);
        }

        $data = [
            'title'       => 'Selamat Datang di Portal Berita',
            'content'     => 'Berita terkini dan terupdate.',
            'artikel'     => $artikel->limit(10)->findAll(),
            'kategori'    => $kategoriModel->findAll(),
---
SELECT *
FROM `artikel`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT *
FROM `kategori`