app/Controllers/Post.php

    public function index()
    {
        try {
            $model = new ArtikelModel();
            $data = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function create()
    {
        $model = new ArtikelModel();

        // Debug: Log request details
        log_message('debug', 'POST request received');
        log_message('debug', 'Content-Type: ' . $this->request->getHeaderLine('Content-Type'));
        log_message('debug', 'POST data: ' . json_encode($this->request->getPost()));

        // Check if request has form data (either from multipart or regular POST)
        $hasFormData = $this->request->getPost('judul') !== null ||
                       $this->request->getFile('gambar') !== null ||
                       (strpos($this->request->getHeaderLine('Content-Type'), 'multipart/form-data') !== false);

        if ($hasFormData) {
            // Handle form data with file upload
            $judul = $this->request->getPost('judul') ?? '';
            $slug = url_title($judul, '-', true);

            // Check if slug already exists and make it unique
            $existingSlug = $model->where('slug', $slug)->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'pemograman'
 LIMIT 1

    public function update($id = null)
    {
        $model = new ArtikelModel();

        // Check if article exists
        $existingArticle = $model->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '5'

    public function delete($id = null)
    {
        $model = new ArtikelModel();

        $article = $model->find($id);
        if ($article) {
            // Delete associated image file if exists
            if (!empty($article['gambar']) && file_exists(FCPATH . 'gambar/' . $article['gambar'])) {
                unlink(FCPATH . 'gambar/' . $article['gambar']);
            }

            $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '2'
DELETE FROM `artikel`
WHERE `id` IN ('2')