app/Controllers/User.php

SELECT *
FROM `user`
WHERE `useremail` = 'admin@example.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Jika tidak ada input email, tampilkan form login
        if (!$email || !$password) {
            return view('user/login');
        }

        $session = session();
        $model = new UserModel();
        $login = $model->where('useremail', $email)->first();